

print("------------------京东商城-------------------")
print("日期   服装名称   价格    库存量     销售量/每日")
print("-------------------------------------")
print("1号	  羽绒服	    253.6	500      10 ")
print("2号	  牛仔裤	     86.3	600      60")
print("3号	   风衣	     96.8	335      43")
print("4号	   皮草	     135.9	855      63")
print("5号	    T血	      65.8	632      120")
print("6号	   衬衫	      49.3	562      72")
print("7号	   牛仔裤	86.3	600      69")
print("8号	   羽绒服	253.6	500      35")
print("9号	   牛仔裤	86.3	600      140")
print("10号	   羽绒服	253.6	500      90")
print("11号	   牛仔裤	86.3	600       24")
print("12号	    皮草	    135.9	855       45")
print("13号	     T血	65.8	632        25")
print("14号	     风衣	96.8	335        60")
print("15号	    牛仔裤	86.3	600        60")
print("16号	       T血	65.8	632        129")
print("17号	      羽绒服	253.6	500        10")
print("18号	      风衣	96.8	335        43")
print("19号	        T血	65.8	632        63")
print("20号	     牛仔裤	86.3	600        60")
print("21号	     皮草	135.9	855        63")
print("22号	     风衣	96.8	335        60")
print("23号	     T血	65.8	632        58")
print("24号	   牛仔裤	86.3	600        140")
print("25号	      T血	65.8	632        48")
print("26号	     风衣	96.8	335        43")
print("27号	     皮草	135.9	855         57")
print("28号	    羽绒服	253.6	500         10")
print("29号	     T血	65.8	632         63")
print("30号	     风衣	96.8	335         78")
print("----------------------------------------")
#羽绒服
a = 253.6*(10+69+140+10+10)
aa = 10+69+140+10+10
#牛仔裤
b = 86.3 *(60+72+35+90+60+60+140)
bb=60+72+35+90+60+60+140
#风衣
c = 96.8 *(43+25+43+60+43+78)
cc=43+25+43+60+43+78
#皮草
d = 135.9 *(63+24+63+57)
dd=63+24+63+57
#T恤
e = 65.8 * (63+45+129+63+58+48+63)
ee=63+45+129+63+58+48+63
#衬衫
f = 49.3 *120
ff=120
zong = a+b+c+d+e+f
jian = aa+bb+cc+dd+ee+ff
print("---------总金额-------")
print("十二月份销售总金额：","￥：,",zong)
print("--------每件服装的销售额占比")
print("羽绒服的销售占比：",a/zong*100,'%')
print("牛仔裤的销售额占比",b/zong*100,'%')
print("风衣的销售额占比",c/zong*100,'%')
print("皮草的销售额占比",d/zong*100,'%')
print("T恤的销售额占比",e/zong*100,'%')
print("衬衫的销售额占比",f/zong*100,'%')
print("----------每件服装的销售件数占比")
print("羽绒服的销售件数占比：",aa/jian*100,'%')
print("牛仔裤的销售件数占比",bb/jian*100,'%')
print("风衣的销售件数占比",cc/jian*100,'%')
print("皮草的销售件数占比",dd/jian*100,'%')
print("T恤的销售件数占比",ee/jian*100,'%')
print("衬衫的销售件数占比",ff/jian*100,'%')










